<template>
<div>
  <div class="greeting-wrapper" ref="greeting">
          <video class="video-content" :src="main" autoplay muted loop ></video>
          <h1 class="title">GIRL BOSS SCHOOL</h1>
  </div>
  <div class="header">
    <section class="about-project">
    </section>
          <div class="about-text">
      <h2>Кто мы?</h2>
      <p>Онлайн-платформа для образования девочек подростков с лекциями и семинарами от ведущих экспертов в направлениях: красота, психология, половое воспитание, профориентация.</p>
      </div>
        <section class="about-project two">
    </section>
      <div class="about-text two">
      <h2>Почему мы?</h2>
      <p> На данный момент в Беларуси и других странах СНГ нет образовательной политики в отношении полового воспитания, отлаженной профориентационной работы. Отсутствуют современные и актуальные ресурсы, которые помогали бы найти ответы на самые острые вопросы девочек, которые идут из поколения в поколение. При стремительном развитии мира показатели числа ранних беременностей, психологических проблем и суицидов среди подростков продолжают оставаться высокими и пугающими. 
</p>
</div>
    <section class="about-project three">
    </section>
      <div class="about-text">
      <h2>Цель проекта</h2>
      <p>Оказать экспертную и психологическую помощь в вопросах самоидентификации, уверенности в себе, правильного ухода за своей внешностью, полового воспитания, профориентирования, подачи себя в обществе, жизненного самоопределения. В проект будут привлечены молодые эксперты с высокой квалификацией, которые в неформальной и близкой подросткам подаче (видео-формат) смогут предоставить важную информацию и поддержку. Мы называем наш проект онлайн-школой, где родители смогут определить для своего ребенка необходимые направления для развития, где сам подросток сможет найти ответы на те вопросы, которые боится задать взрослым. Мы хотим основать комьюнити, где будет раскрываться потенциал каждой девочки, где она сможет получить менторскую поддержку и взаимодействовать с другими участницами. 
</p>
</div>
  </div>
  <ul :class="['menu', {'show' : isShowMenu}]">
    <li>КРАСОТА</li>
    <li>КАРЬЕРА</li>
    <div><img class="logo" :src="logo" alt=""></div>
    <li>ДУША</li>
    <li>ИНТИМНОЕ</li>
  </ul>
</div>
</template>

<script>
export default {
    name: 'MainPage',
    data: () => ({
      main: require("../assets/video/background.mp4"),
      logo: require('../assets/img/mainlogo.png'),
      isShowMenu: false,

    }),
    mounted () {
      this.scrollPage()
},


    methods: {
      scrollPage(){
         window.addEventListener('scroll', () => {
        let value = 1 + window.scrollY/-400
        this.$refs.greeting.style.opacity = value
        this.isShowMenu = window.scrollY >= 200 ?  true : false
})
        }
    }
}
</script>